print("В калькулятора є 2 функії, перша це стандартні операції над числами, друга це піднесення до степеня")
a = int(input("Виберіть функцію:"))
if a == 1:
    x = float(input("Введіть перше число:"))
    y = float(input("Введіть друге число:"))
    znak = input("Введіть знак(+,-,*,/):")
    r = None
    if znak == "-":
        r = x - y
    elif znak == "+":
        r = x + y
    elif znak == "*":
        r = x * y
    elif znak == "/":
        r = x / y
    else:
        print("Введи нормальний знак операції")
    print("Результат:", r)
elif a==2:
    b = float(input("Введи число, яке хочеш піднести до степеня"))
    с = int(input("До якого степеня хочеш піднести"))
    v = b ** c
    print(v)
else:
    print("Є тількі 2 функції")